# Connection to RiskyIP

### [+] Defender for Endpoint 
```
CloudAppEvents
| where IPCategory == "Risky"
| extend
      AlertUri = parse_json(RawEventData).AlertUri,
      AlertDisplayName = parse_json(RawEventData).AlertDisplayName,
      AlertSeverity = parse_json(RawEventData).AlertSeverity
| project  Timestamp, AccountDisplayName, ActionType, IPAddress, IPCategory, ISP, Application, IsAnonymousProxy, DeviceType
```

### [+] Sentinel
```
CloudAppEvents
| where IPCategory == "Risky"
| extend
      AlertUri = parse_json(RawEventData).AlertUri,
      AlertDisplayName = parse_json(RawEventData).AlertDisplayName,
      AlertSeverity = parse_json(RawEventData).AlertSeverity
| project  TimeGenerated, AccountDisplayName, ActionType, IPAddress, IPCategory, ISP, Application, IsAnonymousProxy, DeviceType
```
:exclamation: *You MAY need to turn on **Microsoft 365 Defender** or **Microsoft Defender for Endpoint** Data connector on Sentinel in order for this KQL to work.*

### [+] Description
The query looks for events in cloud applications that involve risky IP addresses and provides additional details on the alerts generated by these events.

### [+] Recommended Actions
1. Investigate the source of the risky IP addresses listed in the query results and determine if any of them are associated with malicious activity.
2. Review the applications listed in the query results to ensure they are approved for use in the organization and there are no unauthorized applications.
3. Monitor the activity of any anonymous proxies listed in the results, as they may be used to hide malicious activity.
4. Review the results for any unusual device types or ISPs that may be associated with malicious activity.

### [+] Resources
- Forked from directly from [@Bert-JanP](https://github.com/Bert-JanP), with some heavy modification, but please give him credit and a follow!
