# Severity Level by Day

### [+] Sentinel 
```
SecurityAlert
| where TimeGenerated > ago (30d)
| where ProviderName == "MDATP"
| summarize Count=count()by AlertSeverity, startofday(TimeGenerated)
| render columnchart with (kind=unstacked, ytitle="Alert Count", xtitle="Day", title="MDE Alert Severity per day")
```
:exclamation: *This chart will NOT work on Defender for Endpoint advanced hunt. Will need to turn on M365 Defender data connectors in order to ingest data.*

### [+] Description 
This visual shows the count of security alerts generated by Microsoft Defender ATP (MDATP) in the past 30 days, grouped by their severity level and the day they were triggered.


