# Severity Level by Day

### [+] Sentinel 
```
// Severity alerts in the past day
SecurityAlert
| where TimeGenerated > ago (30d)
| where ProviderName == "MDATP"
| summarize Count=count()by AlertSeverity, startofday(TimeGenerated)
| render columnchart with (kind=unstacked, ytitle="Amount of Alert", xtitle="Days", title="MDE Alert Severity per day")
```
```
// Severity alerts by the months
SecurityAlert
| where TimeGenerated > ago(365d)
| where ProviderName == "MDATP"
| summarize Count=count() by AlertSeverity, startofmonth(TimeGenerated)
| render columnchart with (kind=unstacked, ytitle="Amount of Alert", xtitle="Month", title="MDE Alert Severity per month")
:exclamation: *This chart will NOT work on Defender for Endpoint advanced hunt. Will need to turn on M365 Defender data connectors in order to ingest data.*
```
### [+] Description 
This visual shows the count of security alerts generated by Microsoft Defender ATP (MDATP) in the past, grouped by their severity level and the day or month they were triggered.


